package com.example.asus_cp.mingli.activity;

import android.app.Activity;
import android.os.Bundle;
import android.widget.TextView;

import com.example.asus_cp.mingli.R;

import java.util.HashMap;
import java.util.Map;

/**
 * 展示每个名人具体的八字内容
 * Created by asus-cp on 2016-05-07.
 */
public class MingRenMIngLiContentActivity extends Activity {
    private Map<String,String>mingContent;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        init();
        setContentView(R.layout.ming_ren_ming_li_content);
        TextView contentTextView= (TextView) findViewById(R.id.text_ming_ren_ming_li_content);
        String name=getIntent().getStringExtra(MingRenListActivity.NAME);
        String content=mingContent.get(name);
        contentTextView.setText(content);
    }

    private void init() {
        mingContent=new HashMap<String,String>();
        mingContent.put("张作霖","乙  己  庚  丁\n" +
                "\n" +
                "亥  卯  辰  丑\n" +
                "\n" +
                "张作霖命造。丁火官星虽弱，却有卯木旺财生助，财官双美，无冲无破，格成大贵。五十四岁开始" +
                "行癸酉大运，酉刃冲去卯财，癸水伤官克去丁官，财官皆失，遇害身亡\n");
        mingContent.put("胡汉民","己 丙 丙 丙\n" +
                "\n" +
                "卯 子 寅 申\n" +
                "\n" +
                "胡汉民命造。天干三丙，又得寅卯相生，身强。子水官星虽秉令，然气泄与寅卯。申金财星又被寅" +
                "冲丙夺，虽有似无，身强官轻。癸酉，壬申二运，财星有力，官旺发贵，由普通学生直仕至广东都督" +
                "，总统府秘书长。四十六岁甲子年，大运辛金，财官双美，任国民党第一届中执委兼广东省省长。八月" +
                "金旺，代行大元帅职。");
        mingContent.put("毛泽东","癸  甲  丁  甲\n" +
                "\n" +
                "巳  子  酉  辰\n" +
                "\n" +
                "  毛主席命造，主席的八字年上透七杀，八字无官杀混杂现象，金、木、水、火、土五德齐备，" +
                "官旺、印旺、身平、财薄、子孙弱，一杀清透人品极其贵重。月、时上透甲木正印生发日元" +
                "丁火，年支巳下暗藏丙火通根日元丁火以助身。但毕竟丁火生于冬月，水克火，尽管月、时上" +
                "有二甲木正印生身，此八字也只能以中平偏弱论定。年上七杀被月、时上的二甲木正印所制，" +
                "所谓七杀有制，主掌生杀大权；甲木正印生在子水之月旺相，优秀文章盖世；印星旺聪明多" +
                "智谋，武略文韬有美名；印旺有杀真文采，印重杀轻逞威风。\n" +
                "  七杀癸水得令，年干透出，且有四金相生，偏旺。虽居冬令不能生木，但有巳中丙火暖局，" +
                "水毕竟生木有情，为本命最旺之五行，为七杀格。《子平真诠》论偏官：煞以攻身，似非美物，" +
                "然大贵之格，多存七煞。盖控制得宜，煞为我用，如非大英雄大豪杰，似难驾驭，而处之有方，" +
                "则惊天动地之功，忽焉而就。此王侯将相所以多存七煞也。官煞同类，而其用有不同。官为阳之" +
                "于阴、阴之于阳，异类相引；煞为阳之于阳、阴之于阴，同类相拒。故官煞虽同为克身之物，" +
                "而有有情无情之分。官不可伤而煞宜制，亦以此也。在官多身弱，官等于煞；煞轻身强，煞同于" +
                "官。此则不可不知也。");
        mingContent.put("谭延闿","己  丁  癸  乙\n" +
                "\n" +
                "卯  丑  丑  卯\n" +
                "\n" +
                "谭延闿命造。己土七杀通根二丑且秉令，又有丁火偏财相生。乙木食神带二禄贴身制杀，三杀三制，" +
                "制服得当，大运水金相序，又生助日元，所有官至国民政府主席。此七杀有制为贵例。\n");
        mingContent.put("齐白石","癸  甲  乙  丙\n" +
                "\n" +
                "亥  子  丑  戌\n" +
                "\n" +
                "齐白石命造，地支亥子丑北方一气，癸水透年干，水气冲天奔低，甲乙无根，水泛木漂。幸时柱" +
                "丙戌，丙可调候吐秀，戌土可制水为堤，惜强水灭火冲土，难以为用。印绶虽居年，然为忌神，所以" +
                "祖上历代务农，家境贫寒。");
        mingContent.put("洪秀全","辛  丁  壬  丁\n" +
                "\n" +
                "未  酉  戌  未\n" +
                "\n" +
                "洪秀全命造。壬水无根，官杀过旺，用辛酉印绶化杀生身。四十岁庚戌年，大运癸巳，癸水灭丁护" +
                "庚辛，印强身旺，冬季起兵金田。四十三岁癸丑年，大运癸巳，运岁原局巳酉丑会全金局，双癸破双" +
                "丁，印星极为有力，定都天京，威震天撼地之伟业。\n");
        mingContent.put("张作相","辛  辛  辛  辛\n" +
                "\n" +
                "巳  卯  丑  卯\n" +
                "\n" +
                "张作相命造。天干辛金一气。通根丑土，日元有力。二卯财星被辛比盖头，有被夺之忧，" +
                "故取巳中丙火官星护财制比为用神。丁亥，丙戌二运，用神有力，任吉林省省长，东北边防军副总" +
                "司令等要职。运入申金，合去巳火用神而亡。");
        mingContent.put("张元忭","戊  癸  戊  甲\n" +
                "\n" +
                "戌  亥  午  寅\n" +
                "\n" +
                "明隆庆年间状元张元忭之命。戊土坐印，年柱戊比坐戌，寅午化火生身，土气厚实。癸亥之财虽通" +
                "月令之气，惜被戊戌贴身抢夺，以甲木七杀制比护财为用神。三十四岁辛未年，岁干辛伤化比生财，" +
                "大运在寅，七杀得根，制比有力，癸亥财旺，状元及第，官授修编。五十岁戊子年，大运戊辰，强比" +
                "夺财，甲木难疏厚土，财星无护被夺，状年病亡。");
        mingContent.put("隆庆皇帝","丁  癸  癸  辛\n" +
                "\n" +
                "\n" +
                "酉  卯  卯  酉\n" +
                "\n" +
                "明穆宗隆庆皇帝命造。虽二酉偏印冲克二卯食神，然木当令，金失时，又有丁克癸化，食神强壮，" +
                "秀气引发。三十岁丙寅年，大运子水，丙合辛，子禄化酉枭生卯食，寅木助时，岁运俱吉，继位" +
                "登基，次年击退鞑靼侵犯。三十六岁壬申你那，大运巳土，壬和丁使其不破酉，己杀生枭，申金助酉，" +
                "枭印势胜，制去卯食，壮年身亡。此造若支下见一子水或亥水，化酉生卯，必主寿长。\n");
        mingContent.put("纪晓岚","甲  辛  丙  甲\n" +
                "\n" +
                "辰  未  戌  午\n" +
                "\n" +
                "清乾隆年间著名文人纪晓岚之命，未土伤官司权，辰戌二土相助，表面看来，也是盗气太旺之像。" +
                "妙在午戌合而化火，未中也藏丁火，辰土湿土，尽收全局燥气，年时二甲，助身吐秀，四柱配合得当，" +
                "富贵双全。");
        mingContent.put("黄庭坚","乙  癸  丙  壬\n" +
                "\n" +
                "酉  未  寅  辰\n" +
                "\n" +
                "黄庭坚命造。丙火虽坐寅木长生，但未辰伤食盗气，壬癸官杀得酉财值生攻身，以乙木印绶化杀制伤" +
                "为用神。二十三岁丁未年，大运辛巳，日元得劫旺之助，中进士。三十五岁己未年，伤官见官，继室" +
                "孙氏死。四十八岁壬申年，大运入己卯，又逢伤官见官，母亡。\n");
        mingContent.put("刘秀","乙  甲  己  丁\n" +
                "\n" +
                "酉  申  巳  卯\n" +
                "\n" +
                "东汉光武帝刘秀命造。日元己土，申金伤官司权，年支酉金助伤，竞相盗气。喜日元自坐巳火印绶，" +
                "时干透出丁火偏印，化杀，制伤，生身，一气呵成，精诚灵妙。己亥年，大运壬午，火气正旺，嗣位" +
                "登基，成为一代英主。");
        mingContent.put("和珅","庚  乙  庚  壬\n" +
                "\n" +
                "午  酉  午  午\n" +
                "\n" +
                "清乾隆宠臣大贪官和珅命造。庚生酉月，虽羊刃司权，年干见此，惜地支三午破酉，反觉刃弱制强，" +
                "以壬食制杀为用神。丁亥，戊子，己丑诸运，制杀护刃，恩宠无比，位极人臣，不可一世。一入寅" +
                "运，财生杀制刃。烈火熔金，家破身亡。");
        mingContent.put("王守仁","壬  辛  癸  癸\n" +
                "\n" +
                "辰  亥  亥  亥\n" +
                "\n" +
                "明朝名臣王守仁的命造。八字叠叠是水，汪洋一片，一点辰土不得不顺从水势，玉成其为润下之格。" +
                "八字以辰土官星为病，能去此病，是为贵征，中年走木运去尽辰土，定当富贵出众。\n" +
                "加之此命有三亥，可以暗中冲出一个无形的巳火来，而巳火中带有戊官丙财，" +
                "这叫飞天禄马，属于一种大贵的奇格。《渊海子平·飞天禄马诗诀》云：飞天禄马贵非常，" +
                "辛癸都来二字强，年月日时重见亥，无官冲绊做贤良。可见，这个辰土官星就是破格的忌神。" +
                "该忌神位于年支母宫，有早年丧母的信息。辛金偏印临月干，被重水化泄（为辛金的伤官），" +
                "为后母悍妒之象。月令亥水中的甲木伤官，是代表日主爱好、说话和表达思想的符号。\n" +
                "伤官为武艺，为清高，兆示命主有喜武的天性和高傲的脾气，且是个文武全才。伤官不透，" +
                "且被大水沤坏，秀气难以表达，说明日主幼年说话迟。中年走食伤运透清时，则会秀气勃发，" +
                "能言善辩。食伤也代表弟子学生，预示命主他日会有很多追随者。");
        mingContent.put("李鸿章","癸 甲 乙 己\n" +
                "\n" +
                "未 寅 亥 卯\n" +
                "\n" +
                "晚晴名臣李鸿章命造。日主乙木，坐下亥水，生于春月木旺之时，而其它干支又多木，" +
                "最重要的是地支均三合木局，八字不见金火二行，纯粹不杂，其木势森森，无可阻挡，" +
                "那么这个格局就叫“一气专旺”格，由于木主仁，所以又叫“曲直仁寿格”这种格局也" +
                "属于变格的一种。");
        mingContent.put("邓小平","甲  壬  戊  壬\n" +
                "\n" +
                "辰  申  子  子\n" +
                "\n" +
                "邓小平的命造。邓小平的八字三合水局而从财，而财又逢将星与天月二德，这个信息就是显示了" +
                "邓小平同志是经济发展能手。邓小平是属大龙的，命三合水局，胎元癸亥，纳音大海水，正是龙" +
                "游大海之贵格。龙要游向大海，闭关自守不是他的性格，改革开放的角号必然要吹响，世界才" +
                "是他真正的大舞台。\n邓小平月令食神，食神主思想，主技术，而壬申纳音是剑锋金，剑锋金是" +
                "真刀真枪，有权威性，日元霹雳火，霹雳火是从天打到海底的，是要彻底落实执行的，那么日" +
                "月柱就有规划落实的信息。所以改革开放与经济发展设计的权威在八字上已经展示。邓小平虽" +
                "然是军事家，但经济更是他的强招牌。而有意思的是，77岁起庚辰大运，是魁罡星，辰为水库，" +
                "引发三合局，有汇总之意，庚是申金透出来的，申金月令为门户，就是门户大开之意。" +
                "而且庚、申为三合财局的总源头。那么庚辰运，敞开国门，吹响经济大发展的角号，" +
                "成为改革开放的总设计师的形象已经跃然纸上了。");

    }

}
